In [1]:
# Dependencies
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [2]:
# We can create a Pandas Series from a raw list

0                             UCLA
1                      UC Berkeley
2                        UC Irvine
3    University of Central Florida
4               Rutgers University
dtype: object

In [3]:
# Convert a list of dictionaries into a DataFrame

        STATE ABBREVIATION
0  New Jersey           NJ
1    New York           NY

In [4]:
# Convert a single dictionary containing lists into a DataFrame

                 Dynasty  Pharaoh
0  Early Dynastic Period   Thinis
1            Old Kingdom  Memphis